IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_memory_error_regs.xml
<module id="MEMORY_ERROR_REGS" HW_revision="" description="MEMORY ERROR Registers">
	<register id="UCERRFLG" width="32" page="1" offset="0x0" internal="0" description="Uncorrectable Error Flag Register">
		<bitfield id="CPURDERR" description="CPU Uncorrectable Read Error Flag " begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="DMARDERR" description="DMA Uncorrectable Read Error Flag " begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CLA1RDERR" description="CLA1 Uncorrectable Read Error Flag " begin="2" end="2" width="1" rwaccess="R"/>
	</register>
	<register id="UCERRSET" width="32" page="1" offset="0x2" internal="0" description="Uncorrectable Error Flag Set Register">
		<bitfield id="CPURDERR" description="CPU Uncorrectable Read Error Flag Set" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DMARDERR" description="DMA Uncorrectable Read Error Flag Set" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLA1RDERR" description="CLA1 Uncorrectable Read Error Flag Set" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="UCERRCLR" width="32" page="1" offset="0x4" internal="0" description="Uncorrectable Error Flag Clear Register">
		<bitfield id="CPURDERR" description="CPU Uncorrectable Read Error Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DMARDERR" description="DMA Uncorrectable Read Error Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLA1RDERR" description="CLA1 Uncorrectable Read Error Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="UCCPUREADDR" width="32" page="1" offset="0x6" internal="0" description="Uncorrectable CPU Read Error Address">
		<bitfield id="UCCPUREADDR" description="Uncorrectable CPU read/fetch access address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UCDMAREADDR" width="32" page="1" offset="0x8" internal="0" description="Uncorrectable DMA Read Error Address">
		<bitfield id="UCDMAREADDR" description="Uncorrectable DMA read access address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UCCLA1READDR" width="32" page="1" offset="0xa" internal="0" description="Uncorrectable CLA1 Read Error Address">
		<bitfield id="UCCLA1READDR" description="Uncorrectable CLA1 read/fetch access address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UCECATRAMADDR" width="32" page="1" offset="0xe" internal="0" description="Uncorrectable etherCAT RAM Read Error Address">
		<bitfield id="UCECATRAMADDR" description="Uncorrectable ECAT RAM address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UCHICAREADDR" width="32" page="1" offset="0x10" internal="0" description="Uncorrectable HICA Read Error Address">
	</register>
	<register id="FLUCERRSTATUS" width="32" page="1" offset="0x1c" internal="0" description="Flash read uncorrectable ecc err status">
		<bitfield id="UNC_ERR_L" description="Lower 64 bits Uncorrectable error occurred" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="DIAG_L_FAIL" description="Diagnostics of ECC on lower 64 bits." begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="UNC_ERR_H" description="Upper 64 bits Uncorrectable error occurred" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="DIAG_H_FAIL" description="Diagnostics of ECC on upper 64 bits." begin="9" end="9" width="1" rwaccess="R"/>
	</register>
	<register id="FLCERRSTATUS" width="32" page="1" offset="0x1e" internal="0" description="Flash read correctable ecc err status">
		<bitfield id="FAIL_0_L" description="Lower 64bits Single Bit Error Corrected Value 0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="FAIL_1_L" description="Lower 64bits Single Bit Error Corrected Value 1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="FAIL_0_H" description="Upper 64bits Single Bit Error Corrected Value 0" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="FAIL_1_H" description="Upper 64bits Single Bit Error Corrected Value 1" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ERR_POS_L" description="Bit Position of Single bit Error in lower 64 bits" begin="21" end="16" width="6" rwaccess="R"/>
		<bitfield id="ERR_TYPE_L" description="Error Type in lower 64 bits" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="ERR_POS_H" description="Bit Position of Single bit Error in upper 64 bits" begin="28" end="23" width="6" rwaccess="R"/>
		<bitfield id="ERR_TYPE_H" description="Error Type in upper 64 bits" begin="29" end="29" width="1" rwaccess="R"/>
	</register>
	<register id="CERRFLG" width="32" page="1" offset="0x20" internal="0" description="Correctable Error Flag Register">
		<bitfield id="CPURDERR" description="CPU Correctable Read Error Flag " begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="DMARDERR" description="DMA Correctable Read Error Flag " begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CLA1RDERR" description="CLA1 Correctable Read Error Flag " begin="2" end="2" width="1" rwaccess="R"/>
	</register>
	<register id="CERRSET" width="32" page="1" offset="0x22" internal="0" description="Correctable Error Flag Set Register">
		<bitfield id="CPURDERR" description="CPU Correctable Read Error Flag Set" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DMARDERR" description="DMA Correctable Read Error Flag Set" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLA1RDERR" description="CLA1 Correctable Read Error Flag Set" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="CERRCLR" width="32" page="1" offset="0x24" internal="0" description="Correctable Error Flag Clear Register">
		<bitfield id="CPURDERR" description="CPU Correctable Read Error Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DMARDERR" description="DMA Correctable Read Error Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLA1RDERR" description="CLA1 Correctable Read Error Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="CCPUREADDR" width="32" page="1" offset="0x26" internal="0" description="Correctable CPU Read Error Address">
		<bitfield id="CCPUREADDR" description="Correctable CPU read/fetch access address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CDMAREADDR" width="32" page="1" offset="0x28" internal="0" description="Correctable DMA Read Error Address">
		<bitfield id="CDMAREADDR" description="Correctable DMA read access address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CCLA1READDR" width="32" page="1" offset="0x2a" internal="0" description="Correctable CLA1 Read Error Address">
		<bitfield id="CCLA1READDR" description="Correctable CLA1 read/fetch access address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CERRCNT" width="32" page="1" offset="0x2e" internal="0" description="Correctable Error Count Register">
		<bitfield id="CERRCNT" description="Correctable error count." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CERRTHRES" width="32" page="1" offset="0x30" internal="0" description="Correctable Error Threshold Value Register">
		<bitfield id="CERRTHRES" description="Correctable error threshold." begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="CEINTFLG" width="32" page="1" offset="0x32" internal="0" description="Correctable Error Interrupt Flag Status Register">
		<bitfield id="CEINTFLAG" description="Total corrected error count exceeded threshold flag." begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="CEINTCLR" width="32" page="1" offset="0x34" internal="0" description="Correctable Error Interrupt Flag Clear Register">
		<bitfield id="CEINTCLR" description="CPU Corrected Error Threshold Exceeded Error Clear." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CEINTSET" width="32" page="1" offset="0x36" internal="0" description="Correctable Error Interrupt Flag Set Register">
		<bitfield id="CEINTSET" description="Total corrected error count exceeded flag set." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CEINTEN" width="32" page="1" offset="0x38" internal="0" description="Correctable Error Interrupt Enable Register">
		<bitfield id="CEINTEN" description="CPU/DMA Correctable Error Interrupt Enable." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
